const skillsData = [
    {
        title: "React JS",
        img: "react.svg",
        level: 40,
        descr: "JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций. React может использоваться для разработки одностраничных и мобильных приложений. Его цель — предоставить высокую скорость, простоту и масштабируемость.",
        path: 1
    },
    {
        title: "Redux",
        img: "redux.svg",
        level: 50,
        descr: "Redux — библиотека для JavaScript с открытым исходным кодом, предназначенная для управления состоянием приложения. Чаще всего используется в связке с React или Angular для разработки клиентской части. Содержит ряд инструментов, позволяющих значительно упростить передачу данных хранилища через контекст.",
        path: 2
    },
    {
        title: "JavaScript",
        img: "js.svg",
        level: 40,
        descr: "Мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией стандарта ECMAScript. JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений. Наиболее широкое применение находит в браузерах как язык сценариев для придания интерактивности веб-страницам.",
        path: 3
    },
    {
        title: "TypeScript",
        img: "typescript.svg",
        level: 25,
        descr: "TypeScript — это расширенная версия JavaScript, главной целью которого является упрощение разработки крупных JS-приложений. Этот язык добавляет много новых принципов — классы, дженерики, интерфейсы, статические типы, что значительно упрощает разработку.",
        path: 4
    },
    {
        title: "HTML5",
        img: "html.svg",
        level: 70,
        descr: "Стандартизированный язык разметки документов во Всемирной паутине. Большинство веб-страниц содержат описание разметки на языке HTML. Язык HTML интерпретируется браузерами; полученный в результате интерпретации форматированный текст отображается на экране монитора компьютера или мобильного устройства.",
        path: 5
    },
    {
        title: "Sass",
        img: "sass.svg",
        level: 50,
        descr: "Метаязык на основе CSS, предназначенный для увеличения уровня абстракции CSS кода и упрощения файлов каскадных таблиц стилей. Язык Sass имеет два синтаксиса: 1) sass — отличается отсутствием фигурных скобок, в нём вложенные элементы реализованы с помощью отступов; 2) SCSS (Sassy CSS) — использует фигурные скобки, как и сам CSS.",
        path: 6
    },
    // {
    //     title: "Firebase",
    //     img: "firebase.svg",
    //     level: 15,
    //     descr: "Основной сервис — облачная СУБД класса NoSQL, позволяющая разработчикам приложений хранить и синхронизировать данные между несколькими клиентами. Поддержаны особенности интеграции с приложениями под операционные системы Android и iOS, реализовано API для приложений на JavaScript, Java, Objective-C и Node.js, также возможно работать напрямую с базой данных в стиле REST из ряда JavaScript-фреймворков, включая AngularJS, React, Vue.js, Ember.js и Backbone.js.",
    //     path: 9
    // },
    {
        title: "Bootstrap 4",
        img: "bootstrap.svg",
        level: 55,
        descr: "Свободный набор инструментов для создания сайтов и веб-приложений. Включает в себя HTML- и CSS-шаблоны оформления для типографики, веб-форм, кнопок, меток, блоков навигации и прочих компонентов веб-интерфейса, включая JavaScript-расширения.",
        path: 7
    },
]

export default skillsData